#ch: 3
nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  # Two Stream

    ######### TransformerBlock One #############
    # stream one
    - [-4, 1, Conv, [64, 3, 2]]    # 0-P1/2
    - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
    - [-1, 3, C2f, [128,True]]   # 2-P2/4
    
    # stream two
    - [-4, 1, Conv, [64, 3, 2]]    # 3-P1/2 
    - [-1, 1, Conv, [128, 3, 2]] # 4-P2/4
    - [-1, 3, C2f, [128,True]]   # 5-P2/4
    
    
    - [[5,2], 1, fusehd, [128]]   # 6-P3/8
    #[-1, 1, CrossLayer, [256, 8]],#11
    - [-1, 1, getreturnrgb, [128]]    # 7-P3/8 stream one x+trans[0]
    - [6, 1, getreturnir, [128]]    # 8-P3/8 stream two x+trans[1]
    
    - [7, 1, Conv, [256, 1, 1]]  # 9-P3/8
    - [-1, 9, C2f, [256,True]]   # 10-P3/8
    
    - [8, 1, Conv, [256, 1, 1]]  # 11-P3/8
    - [-1, 9, C2f, [256,True]]   # 12-P3/8
    
    ######### TransformerBlock Two #############
   # transformer fusion
    - [[12,10], 1, fusehd, [256]]   # 13-P3/8
    #[-1, 1, CrossLayer, [256, 8]],#11
    - [-1, 1, getreturnrgb, [256]]    # 14-P3/8 stream one x+trans[0]
    - [13, 1, getreturnir, [256]]    # 15-P3/8 stream two x+trans[1]


   ######### TransformerBlock Three #############
   # stream one
    - [14, 1, Conv, [512, 1, 1]]   # 16-P4/16
    - [-1, 9, C2f, [512,True]]   # 17-P4/16
    - [-1, 1, Conv, [1024, 1, 1]]    # 18-P5/32
    - [-1, 3, C2f, [1024, True]]   # 19-P5/32
    - [-1, 1, SPPF, [1024, 5]]   # 20-P5/32
   # stream two
    - [15, 1, Conv, [512, 1, 1]]   # 21-P4/16
    - [-1, 9, C2f, [512,True]]   # 22-P4/16
    - [-1, 1, Conv, [1024, 1, 1]]    # 23-P5/32
    - [-1, 3, C2f, [1024, True]]   # 24-P5/32
    - [-1, 1, SPPF, [1024, 5]]   # 25-P5/32
    ######### TransformerBlock Four #############
    # stream one
   
    # stream two
    
    # transformer fusion
    - [[25,20], 1, fusehd, [1024]]#26
    #[-1, 1, CrossLayer, [1024,8]],    # 29-P5/32
    - [-1, 1, getreturnrgb, [1024]]   # 27-P5/32 stream one x+trans[0]
    - [26, 1, getreturnir, [1024]]    # 28-P5/32 stream two x+trans[1]


    ######### Add Block #############
    - [26, 1, getreturnfeature, [1024]]#29
    - [6, 1, getreturnfuse, [128]]   # 30-P3/8 fusion backbone P3
    - [13, 1, getreturnfuse, [256]]   # 31-P4/16 fusion backbone P4
    - [26, 1, getreturnfuse, [1024]] #32



head:
    - [[29,31], 1, Concat, [1]]    # 33 cat backbone P4
    - [-1, 3, C2f, [256]]    # 34
    - [[-1,13], 1, getreturnfeature2, [256]]#35
    
    - [[-1,30], 1, Concat, [1]]    # 36 cat backbone P3
    - [-1, 3, C2f, [128]]    # 37 (P3/8-small)
    - [[-1,6], 1, getreturnfeature2, [128]]# 38 p3
    - [-1, 1, Conv, [256, 3, 2]]   # 39
    
    - [[35,-1], 1, Concat, [1]]    # 40 cat head P4
    - [-1, 3, C2f, [512]]   # 41 (P4/16-medium)

    - [-1, 1, Conv, [512, 3, 2]]    # 42
    
    - [[29,-1], 1, Concat, [1]]     # 43 cat head P5
    - [-1, 3, C2f, [1024]]     # 44 (P5/32-large)

    - [[38, 41, 44], 1, Detect, [nc]]   # Detect(P3, P4, P5)